backend/jmeter/statistics/report01-ano-20.json
{
  "health（基线）" : {
    "transaction" : "health（基线）",
    "sampleCount" : 11997,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 77.43294156872548,
    "medianResTime" : 75.0,
    "minResTime" : 65.0,
    "maxResTime" : 480.0,
    "pct1ResTime" : 82.0,
    "pct2ResTime" : 90.0,
    "pct3ResTime" : 144.02000000000044,
    "throughput" : 39.996932801685624,
    "receivedKBytesPerSec" : 20.55623886265286,
    "sentKBytesPerSec" : 8.002900841354169
  },
  "用户主页信息 get/vo" : {
    "transaction" : "用户主页信息 get/vo",
    "sampleCount" : 11980,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 81.06702838063426,
    "medianResTime" : 79.0,
    "minResTime" : 69.0,
    "maxResTime" : 716.0,
    "pct1ResTime" : 86.0,
    "pct2ResTime" : 92.0,
    "pct3ResTime" : 130.1900000000005,
    "throughput" : 40.04599606894062,
    "receivedKBytesPerSec" : 33.2413053306636,
    "sentKBytesPerSec" : 9.112028402405434
  },
  "标签分类（纯静态基线）" : {
    "transaction" : "标签分类（纯静态基线）",
    "sampleCount" : 11980,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 77.09348914858062,
    "medianResTime" : 75.0,
    "minResTime" : 66.0,
    "maxResTime" : 523.0,
    "pct1ResTime" : 82.0,
    "pct2ResTime" : 88.0,
    "pct3ResTime" : 127.0,
    "throughput" : 40.04572834421944,
    "receivedKBytesPerSec" : 26.631973635169373,
    "sentKBytesPerSec" : 8.564467292367244
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 71932,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 83.19455874993004,
    "medianResTime" : 79.0,
    "minResTime" : 65.0,
    "maxResTime" : 1153.0,
    "pct1ResTime" : 94.0,
    "pct2ResTime" : 107.0,
    "pct3ResTime" : 159.0,
    "throughput" : 239.78292465031933,
    "receivedKBytesPerSec" : 835.3355195405733,
    "sentKBytesPerSec" : 57.05418320899503
  },
  "图片分页列表-走三级缓存" : {
    "transaction" : "图片分页列表-走三级缓存",
    "sampleCount" : 11994,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 79.4196264799064,
    "medianResTime" : 76.0,
    "minResTime" : 66.0,
    "maxResTime" : 1153.0,
    "pct1ResTime" : 86.0,
    "pct2ResTime" : 99.0,
    "pct3ResTime" : 140.0,
    "throughput" : 40.05797953349186,
    "receivedKBytesPerSec" : 289.0120632748417,
    "sentKBytesPerSec" : 10.679519934221952
  },
  "空间分页列表" : {
    "transaction" : "空间分页列表",
    "sampleCount" : 11985,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 90.98080934501492,
    "medianResTime" : 88.0,
    "minResTime" : 76.0,
    "maxResTime" : 721.0,
    "pct1ResTime" : 97.0,
    "pct2ResTime" : 105.0,
    "pct3ResTime" : 156.13999999999942,
    "throughput" : 40.03728127317552,
    "receivedKBytesPerSec" : 178.48651270707643,
    "sentKBytesPerSec" : 10.3612104857339
  },
  "图片分页列表-走DB" : {
    "transaction" : "图片分页列表-走DB",
    "sampleCount" : 11996,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 93.16947315771948,
    "medianResTime" : 89.0,
    "minResTime" : 76.0,
    "maxResTime" : 752.0,
    "pct1ResTime" : 102.0,
    "pct2ResTime" : 117.0,
    "pct3ResTime" : 165.0,
    "throughput" : 40.05168390019799,
    "receivedKBytesPerSec" : 288.9666412643191,
    "sentKBytesPerSec" : 10.443163673196155
  }
}