backend/jmeter/statistics/report01-ano-50.json
{
  "health（基线）" : {
    "transaction" : "health（基线）",
    "sampleCount" : 24816,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 92.35956640876837,
    "medianResTime" : 88.0,
    "minResTime" : 68.0,
    "maxResTime" : 1098.0,
    "pct1ResTime" : 106.0,
    "pct2ResTime" : 119.0,
    "pct3ResTime" : 173.0,
    "throughput" : 82.73489228061051,
    "receivedKBytesPerSec" : 42.52593591846532,
    "sentKBytesPerSec" : 16.552393493328797
  },
  "用户主页信息 get/vo" : {
    "transaction" : "用户主页信息 get/vo",
    "sampleCount" : 24782,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 96.92514728431968,
    "medianResTime" : 93.0,
    "minResTime" : 72.0,
    "maxResTime" : 1096.0,
    "pct1ResTime" : 113.0,
    "pct2ResTime" : 125.0,
    "pct3ResTime" : 181.0,
    "throughput" : 82.88349754847859,
    "receivedKBytesPerSec" : 68.7997782384832,
    "sentKBytesPerSec" : 18.859233328901865
  },
  "标签分类（纯静态基线）" : {
    "transaction" : "标签分类（纯静态基线）",
    "sampleCount" : 24773,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 92.4453235377231,
    "medianResTime" : 88.0,
    "minResTime" : 68.0,
    "maxResTime" : 1180.0,
    "pct1ResTime" : 108.0,
    "pct2ResTime" : 119.0,
    "pct3ResTime" : 173.0,
    "throughput" : 82.88000749409505,
    "receivedKBytesPerSec" : 55.118442483865955,
    "sentKBytesPerSec" : 17.725314102741034
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 148759,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 100.60783549230693,
    "medianResTime" : 94.0,
    "minResTime" : 68.0,
    "maxResTime" : 1195.0,
    "pct1ResTime" : 116.0,
    "pct2ResTime" : 127.0,
    "pct3ResTime" : 171.0,
    "throughput" : 495.88151565557405,
    "receivedKBytesPerSec" : 1727.281992527226,
    "sentKBytesPerSec" : 117.98690105616373
  },
  "图片分页列表-走三级缓存" : {
    "transaction" : "图片分页列表-走三级缓存",
    "sampleCount" : 24792,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 98.1574298160698,
    "medianResTime" : 93.0,
    "minResTime" : 68.0,
    "maxResTime" : 1069.0,
    "pct1ResTime" : 120.0,
    "pct2ResTime" : 132.0,
    "pct3ResTime" : 190.0,
    "throughput" : 82.86483993234978,
    "receivedKBytesPerSec" : 597.8568724806643,
    "sentKBytesPerSec" : 22.091895802276845
  },
  "空间分页列表" : {
    "transaction" : "空间分页列表",
    "sampleCount" : 24787,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 109.33872594505175,
    "medianResTime" : 104.0,
    "minResTime" : 79.0,
    "maxResTime" : 1195.0,
    "pct1ResTime" : 128.0,
    "pct2ResTime" : 144.0,
    "pct3ResTime" : 209.0,
    "throughput" : 82.87028678796146,
    "receivedKBytesPerSec" : 369.43638592484774,
    "sentKBytesPerSec" : 21.445923826962684
  },
  "图片分页列表-走DB" : {
    "transaction" : "图片分页列表-走DB",
    "sampleCount" : 24809,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 114.41335805554434,
    "medianResTime" : 108.0,
    "minResTime" : 81.0,
    "maxResTime" : 1032.0,
    "pct1ResTime" : 139.0,
    "pct2ResTime" : 154.0,
    "pct3ResTime" : 210.0,
    "throughput" : 82.867373455986,
    "receivedKBytesPerSec" : 597.8751514578365,
    "sentKBytesPerSec" : 21.607020227293223
  }
}