backend/jmeter/statistics/report02-login-10.json
{
  "用户登录（BCrypt校验）" : {
    "transaction" : "用户登录（BCrypt校验）",
    "sampleCount" : 3410,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 867.3633431085044,
    "medianResTime" : 785.0,
    "minResTime" : 184.0,
    "maxResTime" : 2601.0,
    "pct1ResTime" : 1363.9,
    "pct2ResTime" : 1479.4499999999998,
    "pct3ResTime" : 1710.359999999997,
    "throughput" : 11.351115638242275,
    "receivedKBytesPerSec" : 12.121447003022526,
    "sentKBytesPerSec" : 3.6544335302302513
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3410,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 867.3633431085044,
    "medianResTime" : 785.0,
    "minResTime" : 184.0,
    "maxResTime" : 2601.0,
    "pct1ResTime" : 1363.9,
    "pct2ResTime" : 1479.4499999999998,
    "pct3ResTime" : 1710.359999999997,
    "throughput" : 11.351115638242275,
    "receivedKBytesPerSec" : 12.121447003022526,
    "sentKBytesPerSec" : 3.6544335302302513
  }
}